Repository: Painkiller56/PrusaSlicer
Catalog: resources/localization/sv.tmx
Source language: en
Languages: sv

source: Switching the language will trigger application restart. You will lose content of the plater.
sv: Om du byter språk startar programmet om. Du kommer att förlora innehållet i plattern.

source: Opening new project while some presets are unsaved.
sv: Öppnar nytt projekt medan vissa förinställningar är osparade.

source: Configuration is editing from ConfigWizard
sv: Konfigurationen redigeras från ConfigWizard

source: Fatal error, exception catched: %1%
sv: Allvarligt fel, undantag fångat: %1%

source: Support parameter change
sv: Stöd parameterändring

source: Wipe options
sv: Torka alternativ

source: Pad and Support
sv: Pad och stöd

source: Fuzzy Skin
sv: Fuzzy hud

source: Skirt and brim
sv: Kjol och brätte

source: Add support enforcer
sv: Lägg till supportenforcer

source: Slab
sv: Platta

source: Suppress to open hyperlink in browser
sv: Undertryck för att öppna hyperlänken i webbläsaren

source: You will not be asked about it again on hyperlinks hovering.
sv: Du kommer inte att bli tillfrågad om det igen på hyperlänkar som svävar.

source: Height range Modifier
sv: Höjdområde Modifierare

source: Printable
sv: Tryckbar

source: Revert conversion from imperial units
sv: Återställ konvertering från kejserliga enheter

source: Revert conversion from meters
sv: Återställ konvertering från mätare

source: Merge objects to the one multipart object
sv: Slå samman objekt till det ena flerdelade objektet

source: Mirror
sv: Spegel

source: To objects
sv: Till föremål

source: Start at height
sv: Börja på höjden

source: Stop at height
sv: Stanna på höjden

source: %1$d degenerate facet
sv: %1$d degenererad aspekt

source: %1$d degenerate facets
sv: %1$d degenererade aspekter

source: Right button click the icon to change the object printable property
sv: Högerklicka på ikonen för att ändra objektets utskrivbara egenskap

source: Click the icon to change the object printable property
sv: Klicka på ikonen för att ändra objektets utskrivbara egenskap

source: Instances to Separated Objects
sv: Förekomster till separerade objekt

source: Load Modifier
sv: Lastmodifierare

source: Loading
sv: Läser in

source: Add Generic Subobject
sv: Lägg till allmänt subobjekt

source: Add Settings Bundle for Height range
sv: Lägg till inställningsgrupp för höjdintervall

source: Object Settings to modify
sv: Objektinställningar att ändra

source: Part Settings to modify
sv: Delinställningar att ändra

source: Layer range Settings to modify
sv: Lagerintervall Inställningar att ändra

source: Part manipulation
sv: Del manipulation

source: Height ranges
sv: Höjdintervall

source: Settings for height range
sv: Inställningar för höjdområde

source: Add Height Range
sv: Lägg till höjdområde

source: Edit Height Range
sv: Redigera höjdområde

source: Repairing model
sv: Reparerande modell

source: Set Mirror
sv: Ställ in spegel

source: You cannot use non-uniform scaling mode for multiple objects/parts selection
sv: Du kan inte använda oenhetligt skalningsläge för val av flera objekt/delar

source: This operation is irreversible. Do you want to proceed?
sv: Denna operation är oåterkallelig. Vill du fortsätta?

source: Overhang perimeter
sv: Överhängs omkrets

source: Skirt/Brim
sv: Kjol/brätte

source: Support material interface
sv: Stödmaterial gränssnitt

source: Wipe tower
sv: Torka tornet

source: Could not arrange model objects! Some geometries may be invalid.
sv: Kunde inte ordna modellobjekt! Vissa geometrier kan vara ogiltiga.

source: Arranging canceled.
sv: Arrangemang inställt.

source: Arranging done.
sv: Ordning klar.

source: Optimize object rotation for best surface quality.
sv: Optimera objektrotationen för bästa ytkvalitet.

source: Optimize object rotation to have minimum amount of overhangs needing support structures. Note that this method will try to find the best surface of the object for touching the print bed if no elevation is set.
sv: Optimera objektrotationen för att få ett minimum av överhäng som behöver stödstrukturer. Observera att denna metod kommer att försöka hitta den bästa ytan på objektet för att vidröra utskriftsbädden om ingen höjd är inställd.

source: Import model only
sv: Endast importmodell

source: Attention!
sv: Uppmärksamhet!

source: New project, clear plater
sv: Nytt projekt, klar tallrik

source: Open project STL/OBJ/AMF/3MF with config, clear plater
sv: Öppna projekt STL/OBJ/AMF/3MF med konfiguration, klar platter

source: (Re)slice
sv: (om)skiva

source: Import STL/OBJ/AMF/3MF without config, keep plater
sv: Importera STL/OBJ/AMF/3MF utan konfiguration, behåll platter

source: Load Config from ini/amf/3mf/gcode and merge
sv: Ladda Config från ini/amf/3mf/gcode och slå samman

source: Reload plater from disk
sv: Ladda om platter från disk

source: Select Plater Tab
sv: Välj Plater Tab

source: Select Filament Settings Tab
sv: Välj Filament Settings Tab

source: Print host upload queue
sv: Skriv ut värduppladdningskö

source: Movement in camera space
sv: Rörelse i kamerautrymmet

source: Rotate selection 45 degrees CCW
sv: Vrid valet 45 grader moturs

source: Rotate selection 45 degrees CW
sv: Vrid valet 45 grader medurs

source: Gizmo FDM paint-on supports
sv: Gizmo FDM-lackstöd

source: Gizmo FDM paint-on seam
sv: Gizmo FDM målad söm

source: Switch between Editor/Preview
sv: Växla mellan Editor/Preview

source: Plater
sv: Plåtslagare

source: All gizmos: Rotate - left mouse button; Pan - right mouse button
sv: Alla prylar: Rotera - vänster musknapp; Panorera - höger musknapp

source: Gizmo move: Press to snap by 1mm
sv: Gizmo move: Tryck för att knäppa med 1 mm

source: Gizmo scale: Press to snap by 5%
sv: Gizmo skala: Tryck för att knäppa med 5 %

source: Gizmo scale: Press to activate one direction scaling
sv: Gizmo-våg: Tryck för att aktivera enriktningsskalning

source: The following shortcuts are applicable when the specified gizmo is active
sv: Följande genvägar är tillämpliga när den angivna gizmo är aktiv

source: Reload the plater from disk
sv: Ladda om plattaren från disken

source: Gizmo scale: Press to scale selected objects around their own center
sv: Gizmo-skala: Tryck för att skala valda objekt runt sitt eget centra

source: Vertical slider - Move active thumb Up
sv: Vertikal skjutreglage - Flytta aktiv tumme upp

source: Vertical slider - Move active thumb Down
sv: Vertikal reglage - Flytta aktiv tumme ned

source: Horizontal slider - Move active thumb Left
sv: Horisontellt reglage - Flytta aktiv tumme åt vänster

source: Horizontal slider - Move active thumb Right
sv: Horisontellt reglage - Flytta aktiv tumme åt höger

source: Move active thumb Up
sv: Flytta aktiv tumme upp

source: Move active thumb Down
sv: Flytta aktiv tumme ner

source: Set upper thumb as active
sv: Ställ in övre tummen som aktiv

source: Set lower thumb as active
sv: Ställ in nedre tummen som aktiv

source: Press to speed up 5 times while moving thumb with arrow keys or mouse wheel
sv: Tryck för att snabba upp 5 gånger medan du flyttar tummen med piltangenter eller mushjul

source: Move active thumb Left
sv: Flytta aktiv tumme åt vänster

source: Move active thumb Right
sv: Flytta aktiv tumme åt höger

source: Set left thumb as active
sv: Ställ in vänster tumme som aktiv

source: Set right thumb as active
sv: Ställ in höger tumme som aktiv

source: Open G-code viewer
sv: Öppna G-code viewer

source: Open new G-code viewer
sv: Öppna en ny G-code viewer

source: Untitled
sv: Ofrälse

source: %s &Website
sv: %s &webbplats

source: Open the %s website in your browser
sv: Öppna webbplatsen %s i din webbläsare

source: System &Info
sv: System information

source: Show &Configuration Folder
sv: Visa &konfigurationsmapp

source: Show user configuration folder (datadir)
sv: Visa användarkonfigurationsmapp (datadir)

source: Show about dialog
sv: Visa om dialog

source: Opens Tip of the day notification in bottom right corner or shows another tip if already opened.
sv: Öppnar meddelande om dagens tips i det nedre högra hörnet eller visar ett annat tips om det redan är öppet.

source: Front
sv: Främre

source: Rear View
sv: Bakåtsikt

source: &Open Project
sv: &Öppet projekt

source: Recent projects
sv: Nyliga projekt

source: Export current plate as G-code
sv: Exportera aktuell platta som G-kod

source: Send to print current plate as G-code
sv: Skicka till tryck aktuell plåt som G-kod

source: Export current plate as STL including supports
sv: Exportera strömplattan som STL inklusive stöd

source: Export Config &Bundle
sv: Exportera Config &Bundle

source: Quick Slice
sv: Snabb skiva

source: Slice a file into a G-code
sv: Dela en fil i en G-kod

source: Quick Slice and Save As
sv: Snabbskiva och spara som

source: Slice a file into a G-code, save as
sv: Dela en fil i en G-kod, spara som

source: Repeat Last Quick Slice
sv: Upprepa sista snabba skivan

source: Repeat last quick slice
sv: Upprepa sista snabba skivan

source: (Re)Slice No&w
sv: (Åter)Slice No&w

source: &G-code Preview
sv: &G-kod förhandsgranskning

source: &Quit
sv: &Sluta med

source: &Select All
sv: Välj alla

source: Selects all objects
sv: Markerar alla objekt

source: &Delete Selected
sv: &Radera valda

source: Deletes the current selection
sv: Tar bort det aktuella valet

source: Deletes all objects
sv: Tar bort alla objekt

source: &Paste
sv: &Klistra

source: &Plater Tab
sv: &Tallrik Tab

source: Show the plater
sv: Visa tallriken

source: Show the 3D slices preview
sv: Visa förhandsvisningen av 3D-skivor

source: Open the dialog to modify shape gallery
sv: Öppna dialogrutan för att ändra formgalleriet

source: &Collapse Sidebar
sv: &Komprimera sidofältet

source: S&end to print
sv: S&skicka för att skriva ut

source: Print &Host Upload Queue
sv: Skrivar- &värduppladdningskö

source: Display the Print Host Upload Queue window
sv: Visa fönstret Print Host Upload Queue

source: &Fullscreen
sv: &Helskärm

source: Choose a file to slice (STL/OBJ/AMF/3MF/PRUSA):
sv: Välj en fil att dela (STL/OBJ/AMF/3MF/PRUSA):

source: Slicing
sv: Skiva

source: %1% was successfully sliced.
sv: %1% har delats upp.

source: Some presets are modified and the unsaved changes will not be exported into configuration bundle.
sv: Vissa förinställningar är modifierade och de osparade ändringarna kommer inte att exporteras till konfigurationspaketet.

source: Speed:
sv: Fart:

source: You have just added a G-code for color change, but its value is empty. To export the G-code correctly, check the "Color Change G-code" in "Printer Settings > Custom G-code"
sv: Du har precis lagt till en G-kod för färgbyte, men dess värde är tomt. För att exportera G-koden korrekt, kontrollera "Color Change G-code" i "Skrivarinställningar > Anpassad G-kod"

source: No color change event was added to the print. The print does not look like a sign.
sv: Ingen färgändringshändelse har lagts till utskriften. Trycket ser inte ut som ett tecken.

source: Desktop integration was successful.
sv: Desktopintegration var framgångsrik.

source: Desktop integration failed.
sv: Desktopintegrering misslyckades.

source: Sinking
sv: Sjunkande

source: Instance %d
sv: Förekomst %d

source: Layers
sv: Skikten

source: Range
sv: Räckvidd

source: As a workaround, you may run PrusaSlicer with a software rendered 3D graphics by running prusa-slicer.exe with the --sw-renderer parameter.
sv: Som en lösning kan du köra PrusaSlicer med en mjukvarurenderad 3D-grafik genom att köra prusa-slicer.exe med parametern --sw-renderer.

source: Type here the name of your printer device
sv: Skriv namnet på din skrivarenhet här

source: Add preset for this printer device
sv: Lägg till förinställning för den här skrivarenheten

source: Print Host upload
sv: Skriv ut värduppladdning

source: Connection to printers connected via the print host failed.
sv: Anslutning till skrivare anslutna via skrivarvärden misslyckades.

source: Could not get a valid Printer Host reference
sv: Det gick inte att få en giltig skrivarvärdreferens

source: Success!
sv: Framgång!

source: HTTPS CA file is optional. It is only needed if you use HTTPS with a self-signed certificate.
sv: HTTPS CA-fil är valfri. Det behövs bara om du använder HTTPS med ett självsignerat certifikat.

source: On this system, %s uses HTTPS certificates from the system Certificate Store or Keychain.
sv: På det här systemet använder %s HTTPS-certifikat från systemets certifikatlager eller nyckelring.

source: To use a custom CA file, please import your CA file into Certificate Store / Keychain.
sv: För att använda en anpassad CA-fil, importera din CA-fil till Certificate Store / Nyckelring.

source: Replace?
sv: Byta ut?

source: For a multipart object, this value isn't accurate. It doesn't take account of intersections and negative volumes.
sv: För ett flerdelat objekt är detta värde inte korrekt. Den tar inte hänsyn till korsningar och negativa volymer.

source: Facets
sv: Facetter

source: Preselects faces by overhang angle. It is possible to restrict paintable facets to only preselected faces when the option "%1%" is enabled.
sv: Förväljer ytor med överhängsvinkel. Det är möjligt att begränsa målningsbara facetter till endast förvalda ytor när alternativet "%1%" är aktiverat.

source: Paints all facets inside, regardless of their orientation.
sv: Målar alla facetter inuti, oavsett orientering.

source: Paints only one facet.
sv: Målar bara en facett.

source: %1$d facet removed
sv: %1$d facett borttagen

source: %1$d facets removed
sv: %1$d facetter borttagna

source: Sliced Info
sv: Skivad info

source: Used Filament (g)
sv: Använd filament (g)

source: Used Filament (m)
sv: Använd filament (m)

source: Used Filament (mm³)
sv: Använd filament (mm³)

source: For support enforcers only
sv: Endast för stödupprättare

source: Select what kind of pad do you need
sv: Välj vilken typ av dyna du behöver

source: Below object
sv: Objekt under

source: Around object
sv: Runt föremål

source: Hold Shift to Slice & Export G-code
sv: Håll ned Skift för att Slice & Export G-code

source: supports and pad
sv: stöd och dyna

source: Used Filament (in)
sv: Använd filament (in)

source: objects
sv: föremål

source: wipe tower
sv: torka tornet

source: Used Filament (in³)
sv: Använd filament (in³)

source: Cost
sv: Kosta

source: Ask for unsaved changes in project
sv: Be om osparade ändringar i projektet

source: You will not be asked about it again, when: - Closing PrusaSlicer, - Loading or creating a new project
sv: Du kommer inte att bli tillfrågad om det igen när: - Stänger PrusaSlicer, - Ladda eller skapa ett nytt projekt

source: Multiple objects were loaded for a multi-material printer. Instead of considering them as multiple objects, should I consider these files to represent a single object having multiple parts?
sv: Flera objekt laddades för en multimaterialskrivare. Istället för att betrakta dem som flera objekt, borde jag överväga det dessa filer för att representera ett enda objekt som har flera delar?

source: The selected object couldn't be split because it contains only one solid part.
sv: Det valda objektet kunde inte delas eftersom det bara innehåller en hel del.

source: An object has custom support enforcers which will not be used because supports are disabled.
sv: Ett objekt har anpassade stödutövare som inte kommer att användas eftersom stöd är inaktiverade.

source: Enable supports for enforcers only
sv: Aktivera stöd för enforcers endast

source: Error during replace
sv: Fel vid byte

source: File for the replace wasn't selected
sv: Filen för ersättningen valdes inte

source: Do you want to replace it
sv: Vill du byta ut den

source: Switching the printer technology from %1% to %2%. Some %1% presets were modified, which will be lost after switching the printer technology.
sv: Byta skrivarteknik från %1% till %2%. Vissa %1% förinställningar har ändrats, som kommer att gå förlorade efter byte av skrivarteknik.

source: Creating a new project while the current project is modified.
sv: Skapar ett nytt projekt medan det aktuella projektet ändras.

source: Creating a new project while some presets are modified.
sv: Skapar ett nytt projekt medan vissa förinställningar ändras.

source: does not contain valid gcode.
sv: innehåller inte giltig gcode.

source: Error while loading .gcode file
sv: Det gick inte att läsa in .gcode-filen

source: %s - Drop project file
sv: %s - Släpp projektfil

source: Action
sv: Handling

source: You can open only one .gcode file at a time.
sv: Du kan bara öppna en .gcode-fil åt gången.

source: Select a gcode file:
sv: Välj en gcode-fil:

source: Import Config from ini/amf/3mf/gcode
sv: Importera konfiguration från ini/amf/3mf/gcode

source: All objects will be removed, continue?
sv: Alla objekt kommer att tas bort, fortsätta?

source: Cut by Plane
sv: Klippt med flyg

source: Associate .gcode files to PrusaSlicer G-code Viewer
sv: Koppla .gcode-filer till PrusaSlicer G-code Viewer

source: If enabled, sets PrusaSlicer G-code Viewer as default application to open .gcode files.
sv: Om det är aktiverat ställer du in PrusaSlicer G-code Viewer som standardprogram för att öppna .gcode-filer.

source: If enabled, changes made using the sequential slider, in preview, apply only to gcode top layer. If disabled, changes made using the sequential slider, in preview, apply to the whole gcode.
sv: Om det är aktiverat, gäller ändringar som görs med skjutreglaget för sekventiell i förhandsgranskning endast för gcode-översta lagret. Om det är inaktiverat gäller ändringar som görs med skjutreglaget för sekventiellt i förhandsgranskningen för hela gcode.

source: Picture sizes to be stored into a .gcode and .sl1 / .sl1s files, in the following format: "XxY, XxY, ..."
sv: Bildstorlekar som ska lagras i en .gcode- och .sl1/.sl1s-filer, i följande format: "XxY, XxY, ..."

source: This end procedure is inserted at the end of the output file, before the printer end gcode (and before any toolchange from this filament in case of multimaterial printers). Note that you can use placeholder variables for all PrusaSlicer settings. If you have multiple extruders, the gcode is processed in extruder order.
sv: Denna slutprocedur infogas i slutet av utdatafilen, före skrivarens slut-gcode (och före varje verktygsbyte från denna filament i händelse av multimaterialskrivare). Observera att du kan använda platshållarvariabler för alla PrusaSlicer-inställningar. Om du har flera extruderare bearbetas gcoden i extruderordning.

source: Custom supports, seams and multimaterial painting were removed after repairing the mesh.
sv: Anpassade stöd, sömmar och multimaterialmålning togs bort efter att ha reparerat nätet.

source: If enabled, allows the Reload from disk command to automatically find and load the files when invoked.
sv: Om det är aktiverat låter kommandot Ladda om från disk automatiskt hitta och ladda filerna när det anropas.

source: If enabled, sets PrusaSlicer as default application to open .3mf files.
sv: Om det är aktiverat ställer du in PrusaSlicer som standardprogram för att öppna .3mf-filer.

source: If enabled, sets PrusaSlicer as default application to open .stl files.
sv: Om det är aktiverat ställer du in PrusaSlicer som standardprogram för att öppna .stl-filer.

source: If enabled, Slic3r downloads updates of built-in system presets in the background. These updates are downloaded into a separate temporary location. When a new preset version becomes available it is offered at application startup.
sv: Om aktiverat laddar Slic3r ned uppdateringar av inbyggda systemförinställningar i bakgrunden. Dessa uppdateringar laddas ner till en separat tillfällig plats. När en ny förinställd version blir tillgänglig erbjuds den vid applikationsstart.

source: PrusaSlicer is based on Slic3r by Alessandro Ranellucci and the RepRap community.
sv: PrusaSlicer är baserad på Slic3r av Alessandro Ranellucci och RepRap-communityt.

source: is based on Slic3r by Alessandro Ranellucci and the RepRap community.
sv: är baserad på Slic3r av Alessandro Ranellucci och RepRap-communityt.

source: based on Slic3r
sv: baserat på Slic3r

source: If this is enabled, Slic3r will prompt the last output directory instead of the one containing the input files.
sv: Om detta är aktiverat kommer Slic3r att fråga den sista utdatakatalogen istället för den som innehåller indatafilerna.

source: If this is enabled, Slic3r will auto-center objects around the print bed center.
sv: Om detta är aktiverat kommer Slic3r att automatiskt centrera objekt runt utskriftsbäddens mitt.

source: If this is enabled, Slic3r will pre-process objects as soon as they're loaded in order to save time when exporting G-code.
sv: Om detta är aktiverat kommer Slic3r att förbehandla objekt så snart de laddas för att spara tid vid export av G-kod.

source: Suppress " - default - " presets
sv: Dämpa " - standard - " förinställningar

source: Suppress " - default - " presets in the Print / Filament / Printer selections once there are any other valid presets available.
sv: Dämpa " - default -" förinställningar i utskrifts-/filament-/skrivarvalen när det finns andra giltiga förinställningar tillgängliga.

source: Slic3r can upload G-code files to a printer host. This field should contain the hostname, IP address or URL of the printer host instance. Print host behind HAProxy with basic auth enabled can be accessed by putting the user name and password into the URL in the following format: https://username:password@your-octopi-address/
sv: Slic3r kan ladda upp G-kodfiler till en skrivarvärd. Det här fältet ska innehålla värdnamnet, IP-adressen eller URL:en för skrivarens värdinstans. Utskriftsvärd bakom HAProxy med grundläggande autentisering aktiverad kan nås genom att ange användarnamn och lösenord i URL:en i följande format: https://användarnamn:lösenord@din-oktopi-adress/

source: Slic3r can upload G-code files to a printer host. This field should contain the API Key or the password required for authentication.
sv: Slic3r kan ladda upp G-kodfiler till en skrivarvärd. Det här fältet bör innehålla API-nyckeln eller lösenordet som krävs för autentisering.

source: This custom code is inserted at every layer change, right before the Z move. Note that you can use placeholder variables for all Slic3r settings as well as [layer_num] and [layer_z].
sv: Denna anpassade kod infogas vid varje lagerbyte, precis innan Z-rörelsen. Observera att du kan använda platshållarvariabler för alla Slic3r-inställningar såväl som [layer_num] och [layer_z].

source: This code is inserted between objects when using sequential printing. By default extruder and bed temperature are reset using non-wait command; however if M104, M109, M140 or M190 are detected in this custom code, Slic3r will not add temperature commands. Note that you can use placeholder variables for all Slic3r settings, so you can put a "M109 S[first_layer_temperature]" command wherever you want.
sv: Denna kod infogas mellan objekt när du använder sekventiell utskrift. Som standard nollställs extrudern och bäddtemperaturen med hjälp av non-wait-kommandot; men om M104, M109, M140 eller M190 upptäcks i denna anpassade kod kommer Slic3r inte att lägga till temperaturkommandon. Observera att du kan använda platshållarvariabler för alla Slic3r-inställningar, så att du kan lägga ett "M109 S[first_layer_temperature]"-kommando var du vill.

source: When printing multi-material objects, this settings will make Slic3r to clip the overlapping object parts one by the other (2nd part will be clipped by the 1st, 3rd part will be clipped by the 1st and 2nd etc).
sv: När du skriver ut objekt med flera material, kommer dessa inställningar att göra att Slic3r klipper de överlappande objektdelarna efter varandra (andra delen klipps av 1:a, 3:e delen klipps av 1:a och 2:a etc).
